Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::RoutingSegment Class Referencefinal
MEP Element Manager
The RoutingSegment can contain Rigid Segment elements. More...
#include <MEPRoutingSegment.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingSegment:
 Classes
class  | Modifier
Modifier of the RoutingSegment. More...
 Public Member Functions
double  | GetCrossSectionWidth () const
double  | GetCrossSectionHeight () const
ConnectorShape  | GetCrossSectionShape () const
Result< uint32_t >  | GetCrossSectionReferenceId () const
std::vector< UniqueID >  | GetRigidSegmentIds () const
UniqueID  | GetBeginNodeId () const
UniqueID  | GetEndNodeId () const
UniqueID  | GetRoutingElementId () const
Domain  | GetDomain () const
RoutingSegmentDefault  | PickUpDefault () const
Picks up and returns the Default of the RoutingSegment.
RigidSegmentDefault  | GetRigidSegmentDefaultParameters () const
UniqueID  | GetPreferenceTableId () const
API_AnchorID  | GetAnchor () const
double  | GetReferenceLineOffsetX () const
double  | GetReferenceLineOffsetY () const
double  | GetWallThickness () const
ConnectionStyle  | GetConnectionStyle () const
std::optional< double >  | GetFlangeSize () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< RoutingSegment >  | Get (const UniqueID &uniqueId)
Returns a Routing Segment.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RoutingSegment can contain Rigid Segment elements.
This type of element is placed between the corner points of RoutingElement.
Since
Archicad 27
Example code snippet from Test / New MEP
Getters
 ACAPI::Result<RoutingSegment> routingSegment = RoutingSegment::Get (id);
 if (routingSegment.IsErr ()) {
 ACAPI_WriteReport (routingSegment.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter routingSegmentReporter (1);
 routingSegmentReporter.Add ("Routing Segment", id);
 routingSegmentReporter.SetTabCount (2);
 ConnectorShape shape = routingSegment->GetCrossSectionShape ();
 routingSegmentReporter.Add ("Table of dimensions ID", routingSegment->GetPreferenceTableId ());
 if (shape == ConnectorShape::Circular)
 routingSegmentReporter.Add ("Reference ID", *routingSegment->GetCrossSectionReferenceId ());
 routingSegmentReporter.Add ("Cross Section Shape", shape);
 routingSegmentReporter.Add ("Cross Section Width", routingSegment->GetCrossSectionWidth ());
 routingSegmentReporter.Add ("Cross Section Height", routingSegment->GetCrossSectionHeight ());
 routingSegmentReporter.Add ("Wall thickness", routingSegment->GetWallThickness ());
 routingSegmentReporter.Add ("Anchor", routingSegment->GetAnchor ());
 routingSegmentReporter.Add ("Offset X", routingSegment->GetReferenceLineOffsetX ());
 routingSegmentReporter.Add ("Offset Y", routingSegment->GetReferenceLineOffsetY ());
 ConnectionStyle style = routingSegment->GetConnectionStyle ();
 routingSegmentReporter.Add ("Connection style", style);
 if (style == ConnectionStyle::Flanged)
 routingSegmentReporter.Add (shape == ConnectorShape::Circular ? "Flange diameter" : "Flange width", *routingSegment->GetFlangeSize ());
 routingSegmentReporter.Add ("Guid of Begin Node", routingSegment->GetBeginNodeId ());
 routingSegmentReporter.Add ("Guid of End Node", routingSegment->GetEndNodeId ());
 routingSegmentReporter.Write ();
 // Rigid Segments
 std::vector<UniqueID> rigidSegmentIds = routingSegment->GetRigidSegmentIds ();
 if (!rigidSegmentIds.empty ()) {
 ACAPI_WriteReport ("\t\tList of Rigid Segments:\n", false);
 for (const UniqueID& id : rigidSegmentIds)
 WriteRigidSegmentDetails (id);
 }
 Modification - Rectangular
 double currentWidth = routingSegment.GetCrossSectionWidth ();
 double currentHeight = routingSegment.GetCrossSectionHeight ();
 ACAPI::Result<void> modifyResult = routingSegment.Modify ([&](RoutingSegment::Modifier& modifier) {
 modifier.SetCrossSectionWidth (0.5 * currentWidth);
 modifier.SetCrossSectionHeight (0.5 * currentHeight);
 }, "Modify the dimensions of Cross Section of Routing Segment.");
 if (modifyResult.IsErr ())
 return modifyResult.UnwrapErr ().kind;
 return NoError;
 Modification - Circular
 uint32_t newReferenceId = 63;
 ACAPI::Result<void> modifyResult = routingSegment.Modify ([&](RoutingSegment::Modifier& modifier) {
 modifier.SetCrossSectionReferenceId (newReferenceId);
 }, "Modify the referenceId of Cross Section of Routing Segment.");
 if (modifyResult.IsErr ())
 return modifyResult.UnwrapErr ().kind;
 return NoError;
Member Function Documentation
◆ Get()
 static Result< RoutingSegment > ACAPI::MEP::RoutingSegment::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a Routing Segment.
Parameters
uniqueId | The UniqueID of the requested RoutingSegment.
Returns
If the uniqueId belongs to a RoutingSegment, returns the object associated to it, otherwise Error.
◆ GetAnchor()
 API_AnchorID ACAPI::MEP::RoutingSegment::GetAnchor  |  ( |   | ) |   const
Returns
Returns the anchor position of the RoutingSegment.
◆ GetBeginNodeId()
 UniqueID ACAPI::MEP::RoutingSegment::GetBeginNodeId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingNode from which the RoutingSegment starts.
◆ GetConnectionStyle()
 ConnectionStyle ACAPI::MEP::RoutingSegment::GetConnectionStyle  |  ( |   | ) |   const
Returns
Returns the connection style used by the RigidSegment's Ports.
◆ GetCrossSectionHeight()
 double ACAPI::MEP::RoutingSegment::GetCrossSectionHeight  |  ( |   | ) |   const
Returns
Returns the height of the RoutingSegment.
◆ GetCrossSectionReferenceId()
 Result< uint32_t > ACAPI::MEP::RoutingSegment::GetCrossSectionReferenceId  |  ( |   | ) |   const
Returns
Returns error if the Cross Section shape is Rectangular, otherwise the referenceId of the Circular Cross Section in the RoutingSegment.
◆ GetCrossSectionShape()
 ConnectorShape ACAPI::MEP::RoutingSegment::GetCrossSectionShape  |  ( |   | ) |   const
Returns
Returns the shape of the RoutingSegment.
◆ GetCrossSectionWidth()
 double ACAPI::MEP::RoutingSegment::GetCrossSectionWidth  |  ( |   | ) |   const
Returns
Returns the width of the RoutingSegment.
◆ GetDomain()
 Domain ACAPI::MEP::RoutingSegment::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the RoutingSegment.
◆ GetEndNodeId()
 UniqueID ACAPI::MEP::RoutingSegment::GetEndNodeId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingNode at which the RoutingSegment ends.
◆ GetFlangeSize()
 std::optional< double > ACAPI::MEP::RoutingSegment::GetFlangeSize  |  ( |   | ) |   const
Returns
Returns the size of the flange (width for Ventilation, diameter for Piping) if the connection style is Flanged.
◆ GetPreferenceTableId()
 UniqueID ACAPI::MEP::RoutingSegment::GetPreferenceTableId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the PreferenceTable is associated with.
◆ GetReferenceLineOffsetX()
 double ACAPI::MEP::RoutingSegment::GetReferenceLineOffsetX  |  ( |   | ) |   const
Returns
Returns the offset from the reference line along the X-axis of cross-section's plane.
◆ GetReferenceLineOffsetY()
 double ACAPI::MEP::RoutingSegment::GetReferenceLineOffsetY  |  ( |   | ) |   const
Returns
Returns the offset from the reference line along the Y-axis of cross-section's plane.
◆ GetRigidSegmentDefaultParameters()
 RigidSegmentDefault ACAPI::MEP::RoutingSegment::GetRigidSegmentDefaultParameters  |  ( |   | ) |   const
Returns
Returns the default parameters of the uncustomized RigidSegments.
◆ GetRigidSegmentIds()
 std::vector< UniqueID > ACAPI::MEP::RoutingSegment::GetRigidSegmentIds  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the RigidSegments contained by the RoutingSegment.
◆ GetRoutingElementId()
 UniqueID ACAPI::MEP::RoutingSegment::GetRoutingElementId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingElement that it belongs to.
◆ GetWallThickness()
 double ACAPI::MEP::RoutingSegment::GetWallThickness  |  ( |   | ) |   const
Returns
Returns the wall thickness of the RoutingSegment. The RigidSegment's Port will use this value as well.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::RoutingSegment::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 RoutingSegmentDefault ACAPI::MEP::RoutingSegment::PickUpDefault  |  ( |   | ) |   const
Picks up and returns the Default of the RoutingSegment.
Returns
Returns a RoutingSegmentDefault with the parameters of the object it was called for.